# ObjPropsEditDlg

## Description
Show object properties edit dialog.

```pascal
FUNCTION ObjPropsEditDlg(hObj : HANDLE) : BOOLEAN;
```

```python

def vs.ObjPropsEditDlg(hObj):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE|The object which properties will be edited.|

## Returns
Return TRUE if the edit was successful.

## Version
Availability: from Vectorworks 2017
## Category
* Utility